OF_article_cases/FallingSphereSuspensionMorphing/0_org/pa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pa;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset
    {
        type            overset;
    }

    sphere
    {
        type            zeroGradient;

    }
    atmosphere
    {
        type            zeroGradient;

    }
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;

    }
    top
    {
        type            zeroGradient;

    }
    Bottom
    {
        type            zeroGradient;

    }
    frontAndBack
    {
        type            zeroGradient;

    }
}


// ************************************************************************* //
