OF_article_cases/FallingSphereSuspensionMorphing/0_org/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 123;  

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    Bottom
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
    oversetPatch
    {
        type            overset;
        value           uniform 1;
    }
    sphere
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;

    }
}


// ************************************************************************* //
