OF_article_cases/FallingSphereSuspensionMorphing/system/topoSetDictR2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    
        {
        name    cref2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.03 -0.03 -0.17) (0.03 0.03 1);
        }
    }
    {
        name    cR2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set cref2;
        }
    }

);

// ************************************************************************* //
